import React from 'react';

const About = () => {
    return (
        <div className="container-box">
            <h1 style={{textDecoration: 'underline', marginBottom: '40px'}}>Вітаємо у вікторіні! Гра має такі розділи:</h1>

            <h2>Вікторина</h2>
            <p>
                • Пограти без вказування теми та складності. Типи відповідей також не визначені.
            </p>
            <h2>Тематична</h2>
            <p>
                • Дає можливість вибрати тему та складність. Типи відповідей - 4 відповіді.
            </p>
            <h2>Віші результати</h2>
            <p>
                • Показує результати вашіх ігор за весь період.
            </p>
            <h2>Рейтинг користувачів</h2>
            <p>
                • Сортує усіх користувачів за рейтингом, показує сумарний бал кожного користувача.
            </p>
        </div>
    );
};

export default About;
